import React from "react";
import * as m from "@/paraglide/messages";

const Main = () => {
  return (
    <>
      <section className="p-16">
        <h1 className="font-pixel text-9xl">
          {m.title1()}
          <br />
          {m.title2()}
        </h1>
      </section>
      <section className="relative z-20 border-t-4 border-vastsea-white bg-vastsea-black p-16">
        <p className="font-pixel text-xl">
          本项目重构始于12月27日晚十点半，12月28日下午已由 Github
          <a
            className="bg-vastsea-cyan mx-2 px-2 text-vastsea-black"
            href="https://github.com/Artist-MOBAI"
          >
            Artist-MOBAI
          </a>
          一人独立重构完成，此期间的一切视觉效果均不代表最终视觉效果。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。
        </p>
      </section>
    </>
  );
};

export default Main;
