import React from "react";
import * as m from "@/paraglide/messages";
import Quote from "./ui/main/quote";
import Button from "./ui/main/button";

const Test = () => {
  return (
    <>
      <section className="py-2 border-b-2 border-vastsea-black">
        <h1 className="text-9xl font-pixel">
          {m.title1()}
          <br />
          {m.title2()}
        </h1>
        <Quote message={m.quote()} />
        <div className="flex felx-row mt-12">
          <Button message={m.button1()} />
          <Button message={m.button2()} />
        </div>
      </section>
      <section className="mb-24">
        <Quote message="本项目处于重构与测试阶段。未做过任何设计，无法代表最终视觉效果" />
        <p className="pt-10 font-pixel text-xl">
          本项目重构始于12月27日晚十点半，现在是12月28日下午，已由 Github
          <a
            className="bg-vastsea-green mx-2"
            href="https://github.com/Artist-MOBAI"
          >
            Artist-MOBAI
          </a>
          一人独立重构完成。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。如果您爱好铁路，您可以在城市中心建设城市轨道交通；亦或在城市的郊区建设国家铁路系统。如果您爱好建筑，您可以在城市中建设小区、学校、医院等一系列城市建筑。如果您爱好游戏中的生活，那么您可以以居民身份在服内畅游。
        </p>
      </section>
    </>
  );
};

export default Test;
